import numpy as np

# Вектор с 10 нулями
z = np.zeros(10)
print(z)

# Вектор с 8 единицами
y = np.ones(8)
print(y)

# Вектор с 5 2.5
t = np.full(5,2.5)
print(t)

# Создать массив
m = np.array([1,2,3,4])
print(m)

# Создание определенного массива
r = np.arange(10,50)
print(r)